[
  {
    "icon": "🛠️",
    "title": "DSWD Region IV-A",
    "sub_title": "Computer Programmer III (Fullstack Developer)",
    "date": "Sept 2025 - Present",
    "description": [
      "Collaborated with developers across multiple regions nationwide to implement a complex system that automates daily processes for DSWD personnels.",
      "Develop full-stack applications with Laravel, Node.js, MySQL, React, Inertia.js, and shadcn/ui, delivering scalable backends and responsive UIs.",
      "Implement REST APIs, service-layer architecture, authentication (Sanctum/Passport), and optimized Eloquent queries following SOLID principles.",
      "UBuild reusable React components with Tailwind CSS and efficient state management.",
      "Utilized Git for project collaboration and version control.",
      "Design relational schemas, indexing strategies, and high-performance data workflows.",
      "Collaborate in Agile/Scrum processes with sprints, standups, code reviews, and documentation"
    ],
    "image": "/images/exp/DSWD.png",
    "technology": [
      "Laravel",
      "NodeJS",
      "ReactJS",
      "VueJS",
      "MySQL",
      "Tailwind",
      "IIS",
      "Git",
      "Github",
      "ShadCN/UI",
      "Agile",
      "SCRUM"
    ]
  },
  {
    "icon": "🛠️",
    "title": "SMPIC",
    "sub_title": "Systems Developer - Fullstack Developer",
    "date": "Sept 2023 - Sept 2025",
    "description": [
      "Rebuilt and modernized legacy desktop systems into fully responsive web-based applications using Laravel, Vue, React, and Inertia.js, significantly improving accessibility and user experience.",
      "Designed optimized MySQL schemas, added indexes, and improved query performance using Eloquent/Query Builder.",
      "Collaborated closely with cross-functional teams and tech leads for requirements analysis, architecture planning, code reviews, and adherence to engineering best practices.",
      "Actively participated in Agile/Scrum ceremonies, delivering iterative features, refining user stories, and ensuring alignment with sprint goals."
    ],
    "image": "/images/exp/PETNET.png",
    "technology": [
      "Laravel",
      "VueJS",
      "MySQL",
      "Tailwind",
      "Git",
      "Github",
      "ShadCN/UI",
      "Agile",
      "SCRUM"
    ]
  },
  {
    "icon": "🛠️",
    "title": "R-NET Wired Internet Services",
    "sub_title": "Back-end Developer - Payment Gateway Integration",
    "date": "May 2023 - Aug 2023",
    "description": [
      "Developed a user-friendly website using Laravel, focused on ease of use and functionality.",
      "Integrated the Xendit payment gateway to enable seamless online bill payments.",
      "Facilitated real-time payment information display on the UISP CRM server, enhancing billing efficiency."
    ],
    "image": "/images/exp/DSC.png",
    "technology": ["Laravel", "Xendit", "CRM"]
  },
  {
    "icon": "🛠️",
    "title": "ReLaunch Marketing & Advertising Services",
    "sub_title": "Web Developer",
    "date": "March 2023 - Aug 2023",
    "description": [
      "Integrated Stripe and PayPal payment gateways into e-commerce CRM using WordPress, Elementor, and Shopify, enhancing transaction capabilities.",
      "Designed and optimized user interfaces with Figma and Elementor to ensure a seamless and efficient customer experience.",
      "Implement on-page SEO strategies to optimize website performance and visibility.",
      "Collaborated with the team to implement best practices in e-commerce integration, improving system efficiency and reliability.",
      "Create interactive prototypes, ensuring a smooth transition from design to development."
    ],
    "image": "/images/exp/DSC.png",
    "technology": [
      "Wordpress",
      "Figma",
      "Elementor",
      "Stripe",
      "PayPal",
      "Wix",
      "Shopify"
    ]
  }
]
