[
  {
    "name": "IPPMIS",
    "project_link": "",
    "project_logo": "images/system.png",
    "description": "Laravel + ReactJS + Typescript + ShadCN UI",
    "long_description": "Integrated Personnel Payroll Management System designed to automate the employees payroll and provide robust solution to templates.",
    "technology": [
      "Laravel",
      "MySQL",
      "ReactJS",
      "ShadCN UI",
      "Tailwind",
      "InertiaJS",
      "Typescript"
    ],
    "platform": ["Web"],
    "status": ["Completed"],
    "type": "Full time project",
    "role": ["Full Stack Developer"],
    "source_code": [],
    "images_path": [
      "/images/portfolio/ippms1.jpg",
      "/images/portfolio/ippms2.png"
    ],
    "images_num_web": 2,
    "higlights": [
      "Built and deployed the project from the ground up",
      "Developed Scalable Codebase and Modular Architecture",
      "Collaborated with the senior developer to ensure code quality and solutions aligned with development standards",
      "Deployed the application on IIS, utilizing an in-house server to make it publicly accessible"
    ],
    "isWebFirst": true
  },
  {
    "name": "SIMASS",
    "project_link": "",
    "project_logo": "images/system.png",
    "description": "Laravel + ReactJS + Typescript + ShadCN UI",
    "long_description": "SIMASS is a comprehensive system designed to automate daily production processes across multiple modules. Each module handles specific aspects of production workflow, including task tracking, resource management, and process monitoring. The system provides real-time insights and reports to improve operational efficiency and reduce manual workload. Built with a responsive interface, SIMASS ensures seamless usability across mobile, tablet, and desktop devices.",
    "technology": [
      "Laravel",
      "MSSQL",
      "ReactJS",
      "ShadCN UI",
      "Tailwind",
      "InertiaJS",
      "Typescript"
    ],
    "platform": ["Web"],
    "status": ["Completed"],
    "type": "Full time project",
    "role": ["Full Stack Developer"],
    "source_code": [],
    "images_path": ["/images/portfolio/simass1.png"],
    "images_num_web": 2,
    "higlights": [
      "Developed and deployed SIMASS to automate daily production processes",
      "Implemented multiple modules to streamline production workflow and monitoring",
      "Enabled real-time tracking and reporting for production efficiency",
      "Optimized the system for responsive use on mobile, tablet, and desktop devices"
    ],
    "isWebFirst": true
  },
  {
    "name": "Payment Gateway Integration",
    "project_link": "https://kichieats.ph/",
    "project_logo": "images/system.png",
    "description": "Laravel + VueJS(Nuxt)",
    "long_description": "An Inventory Management System designed to simplify inventory tracking and stock management. The system generates QR codes for each item, allowing for quick scanning and accurate monthly inventory checks. It also provides real-time updates on stock levels, item details, and movement history. With a responsive interface, the platform ensures efficient and user-friendly management of inventory across mobile, tablet, and desktop devices.",
    "technology": ["Laravel", "Xendit", "CRM"],
    "platform": ["Web"],
    "status": ["Active"],
    "type": "Freelance",
    "role": ["Back-end Developer"],
    "source_code": [],
    "images_path": ["/images/portfolio/rnet1.png"],
    "images_num_web": 1,
    "higlights": [
      "Developed a user-friendly website using Laravel, focusing on usability and functionality.",
      "Integrated Xendit for seamless online bill payments.",
      "Enabled real-time payment updates on the UISP CRM server.",
      "Improved billing efficiency through streamlined payment processing."
    ],
    "isWebFirst": true
  },
  {
    "name": "Medical Appointment System",
    "project_link": "http://hrdotnet-dayone.intellismartinc.com:5173/",
    "project_logo": "images/system.png",
    "description": ".Net + React + Typescript",
    "long_description": "A Medical Appointment System that allows clients to conveniently book appointments online and consult with healthcare professionals through the platform. The system also enables users to download their medical certificates directly, streamlining administrative processes. With centralized management for appointments, consultations, and patient records, the platform ensures efficiency, accuracy, and a user-friendly experience across mobile, tablet, and desktop devices.",
    "technology": [
      "Laravel",
      "VueJS",
      "MySQL",
      "Tailwind",
      "ShadCN UI",
      "InertiaJS",
      "Typescript",
      "Twilio"
    ],
    "platform": ["Web"],
    "status": ["Completed"],
    "type": "Freelance",
    "role": ["Full Stack Developer"],
    "source_code": [],
    "images_path": [
      "/images/portfolio/med3.jpg",
      "/images/portfolio/med1.png",
      "/images/portfolio/med2.png"
    ],
    "images_num_web": 3,
    "higlights": [
      "Developed and launched a Medical Appointment System for online bookings",
      "Enabled clients to schedule appointments and conduct online consultations",
      "Provided functionality to download medical certificates directly from system",
      "Optimized the platform for seamless use on mobile, tablet, and desktop"
    ],
    "isWebFirst": true
  },
  {
    "name": "Resort Booking System",
    "project_logo": "images/system.png",
    "description": ".Net + C# + WPF",
    "long_description": "A fully featured Resort Management System that allows clients to conveniently book accommodations online with real-time availability. The system integrates a secure payment gateway for smooth and reliable transactions. It also provides automated email and SMS notifications to keep clients informed about booking confirmations, payment status, and updates. Designed with a responsive interface, the platform ensures a seamless booking experience across mobile, tablet, and desktop devices.",
    "technology": [
      "Laravel",
      "ReactJS",
      "MySQL",
      "TailwindCSS",
      "InertiaJS",
      "ShadCN UI",
      "Typescript",
      "Xendit",
      "MessageBird"
    ],
    "platform": ["Desktop"],
    "status": ["Completed"],
    "type": "Freelance",
    "role": ["Full Stack Developer"],
    "source_code": [],
    "images_path": ["/images/portfolio/resort1.jpg"],
    "images_num_web": 2,
    "higlights": [
      "Developed and launched an online Resort Management System",
      "Implemented a booking module with integrated payment gateway",
      "Added automated email and SMS notifications for bookings and updates",
      "Optimized the platform for seamless use across all devices"
    ],
    "isWebFirst": true
  },
  {
    "name": "Loan Management System",
    "project_link": "",
    "project_logo": "images/system.png",
    "description": "Flutter + Dart + Firebase",
    "long_description": "A Loan Management System that allows clients to apply for loans online by submitting their required documents securely. The system provides an administrative interface where personnel can review, process, and manage loan applications efficiently. With automated tracking of application status and a responsive design, the platform ensures a smooth experience for both clients and staff across mobile, tablet, and desktop devices.",
    "technology": [
      "Laravel",
      "VueJS",
      "MySQL",
      "ShadCN UI",
      "Tailwind",
      "InertiaJS",
      "Typescript"
    ],
    "platform": ["Mobile"],
    "status": ["Completed"],
    "type": "Freelance",
    "role": ["Full Stack Developer"],
    "source_code": [],
    "images_path": ["/images/portfolio/loan1.jpg"],
    "images_num_web": 0,
    "images_num_mobile": 5,
    "higlights": [
      "Developed and launched a Loan Management System for online enrollment",
      "Enabled clients to submit loan applications with required document uploads",
      "Implemented an admin module for processing and managing loan applications",
      "Optimized the platform for responsive use on mobile, tablet, and desktop devices"
    ],
    "isWebFirst": true
  },
  {
    "name": "Dietary System",
    "project_link": "https://alumni-portal-rosy.vercel.app/",
    "project_logo": "images/system.png",
    "description": "SASS + NuxtJS + Tailwind",
    "long_description": "A Dietary Predicting System designed to assess users’ health and detect potential kidney problems. Based on the analysis, the system generates personalized diet guidelines to support better health and nutrition. The platform centralizes user profiles, health assessments, and diet recommendations, providing a comprehensive and accessible tool for managing dietary needs. It features a responsive interface to ensure usability across mobile, tablet, and desktop devices.",
    "technology": [
      "Php",
      "Bootstrap",
      "MySQL",
      "Jquery",
      "Phpmyadmin",
      "Swal",
      "Composer"
    ],
    "platform": ["Web"],
    "status": ["Completed"],
    "type": "Freelance",
    "role": ["Full Stack Developer"],
    "source_code": [],
    "images_path": ["/images/portfolio/diet1.jpg"],
    "images_num_web": 7,
    "higlights": [
      "Developed and deployed a Dietary Predicting System from scratch",
      "Implemented a health detection module to identify potential kidney issues",
      "Provided personalized diet guidelines based on user health data",
      "Optimized the system for use across mobile, tablet, and desktop devices"
    ],
    "isWebFirst": true
  },
  {
    "name": "Scholar Management System",
    "project_link": "",
    "project_logo": "images/system.png",
    "description": "Laravel + VueJS + MySQL + Tailwind",
    "long_description": "A comprehensive Scholarship Management System designed to automate scholar assessments and streamline the tracking of financial assistance. The system enables scholarship applicants and active scholars to take exams online, with automated evaluation and result recording. It also includes a dedicated module for managing and documenting cash assistance releases, ensuring transparency and organized distribution records. The platform centralizes scholar profiles, exam results, and financial logs, providing administrators with an efficient tool to oversee the entire scholarship lifecycle.",
    "technology": [
      "Php",
      "Bootstrap",
      "MySQL",
      "Jquery",
      "Phpmyadmin",
      "Swal",
      "Composer"
    ],
    "platform": ["Web"],
    "status": ["Completed"],
    "type": "Freelance",
    "role": ["Full Stack Developer"],
    "source_code": [],
    "images_path": [],
    "images_num_web": 2,
    "higlights": [
      "Developed and launched the Scholarship Management System from scratch",
      "Built automated online exams with real-time scoring",
      "Implemented secure tracking for scholar cash assistance",
      "Optimized the system for full mobile and desktop responsiveness"
    ],
    "isWebFirst": true
  }
]
